import sys
from pathlib import Path
from re import match, VERBOSE

#->->->->->->->->->->***THIRD TASK***<-<-<-<-<-<-<-<-<-<
'''
Розробіть скрипт, який приймає шлях до директорії в якості аргументу командного рядка і візуалізує структуру цієї директорії, виводячи імена всіх піддиректорій та файлів. Для кращого візуального сприйняття, імена директорій та файлів мають відрізнятися за кольором.

Вимоги до завдання:

+Створіть віртуальне оточення Python для ізоляції залежностей проєкту.
Скрипт має отримувати шлях до директорії як аргумент при запуску. Цей шлях вказує, де знаходиться директорія, структуру якої потрібно відобразити.
Використання бібліотеки colorama для реалізації кольорового виведення.
Скрипт має коректно відображати як імена директорій, так і імена файлів, використовуючи рекурсивний спосіб обходу директорій (можна, за бажанням, використати не рекурсивний спосіб).
Повинна бути перевірка та обробка помилок, наприклад, якщо вказаний шлях не існує або він не веде до директорії.


Рекомендації для виконання:

Спочатку встановіть бібліотеку colorama. Для цього створіть та активуйте віртуальне оточення Python, а потім встановіть пакет за допомогою pip.
Використовуйте модуль sys для отримання шляху до директорії як аргументу командного рядка.
Для роботи з файловою системою використовуйте модуль pathlib.
Забезпечте належне форматування виводу, використовуючи функції colorama.


Критерії оцінювання:

Створення та використання віртуального оточення.
Правильність отримання та обробки шляху до директорії.
Точність виведення структури директорії.
Коректне застосування кольорового виведення за допомогою colorama.
Якість коду, включаючи читабельність, структурування та коментарі.


Приклад використання:

Якщо виконати скрипт та передати йому абсолютний шлях до директорії як параметр.

python hw03.py /шлях/до/вашої/директорії



Це призведе до виведення в терміналі списку всіх піддиректорій та файлів у вказаній директорії з використанням різних кольорів для піддиректорій та файлів, що полегшить візуальне сприйняття файлової структури.

Для директорії зі наступною структурою

📦picture
 ┣ 📂Logo
 ┃ ┣ 📜IBM+Logo.png
 ┃ ┣ 📜ibm.svg
 ┃ ┗ 📜logo-tm.png
 ┣ 📜bot-icon.png
 ┗ 📜mongodb.jpg

скрипт повинен вивести схожу структуру:
'''
print ('\n\tTHIRD TASK\n')

print (sys.argv[1])
print (type(Path(sys.argv[1])))
print (Path(sys.argv[1]).exists())

# функція для виводу детальної довідки по запиту '-h', '--help', '/?'
def show_detailed_help():
    print("""
📄 Зразок використання:
    python dir_script.py <шлях_до_директорії>

🔹 Аргументи:
    <шлях_до_файлу>     Шлях до текстового файлу, який потрібно прочитати.
    --help              Показати це повідомлення.

Приклад:
    python script.py .\dir
""")
    
# функція для виводу короткої довідки при невідповідності параметрів
def show_short_help():
    print("""
📄 Для отримання довідки введіть: 
    python script.py -h
    python script.py --help
    python script.py /?
""")

# функція для перевірки чи в аргумент передано шлях до теки
def path_validation(path: str) -> bool:
    pattern = r'''^                # початок рядка
        (:\.|[a-zA-Z]:)            # або . (відносний шлях), або диск C:, D:...
        (:[\\/][^<>:"/\\|?*\n]+)*  # одна або більше тек через \ або /
        [\\/]?                     # необов'язковий останній слеш
        $                          # кінець рядка
    '''
    return bool(match(pattern, path, VERBOSE))

# для тестування
# print(is_valid_directory_path("C:\\Users\\me\\Documents\\"))   #  True
# print(is_valid_directory_path("/home/user/folder"))            #  True
# print(is_valid_directory_path("./my/folder/"))                 #  True
# print(is_valid_directory_path("folder/subfolder"))             #  True
# print(is_valid_directory_path("file.txt"))                     #  False
# print(is_valid_directory_path("C:\\file.txt"))                 #  False

if len(sys.argv) != 2:
    show_short_help()
elif sys.argv[1] in ('-h', '--help', '/?'):
    show_detailed_help()
elif path_validation(sys.argv[1]):
    ...#основна функція
else:
    show_short_help()

# function for generating dictionaries from file data

